area = input()
type_apartment = input()
type_bilding = input()
year = int(input())
floor = int(input())
floors_total = int(input())

if type_bilding == 'панелен блок':
    ending = 'етажен'
elif type_bilding == 'ЕПК блок':
    ending = 'етажен'
elif type_bilding == 'нова сграда':
    ending = 'етажна'
else:
    ending = 'етажен'

print(f"""
➡️ НОВА ОФЕРТА ➡️

➡️ На Вашето внимание представяме {type_apartment} апартамент в {area}. 
Намира се в близост до метростанция, спирки на градски транспорт, магазини и заведения.

➡️ Намира се на {floor} етаж от {floors_total} {ending} {type_bilding} от {year} г.

➡️ Имотът е със следното разпределение: антре, кухня, хол със спалня, баня с тоалетна и тераса.

ℹ️ За повече информация или оглед се обадете на посочения телефон.

➡️ Притеснявате се от ремонта на жилището - ще Ви консултираме и за него!

☎️ Реф. номер: 17022026-2

✔️ Предлагаме интериорен дизайн.
✔️ Предлагаме съдействие при банково кредитиране.
✔️ Предлагаме довършителни работи.

✅Ние сме агенция за недвижими имоти Ей Ви Партнърс. За да следите нашите актуални предложения, както и да получавате полезна информация свързана с пазара на недвижими имоти може да харесате нашата фейсбук страница:

https://m.facebook.com/AVPartnersSofia


✅ Не се колебайте да ни потърсите!
✔️ За нас ще бъде удоволствие да работим заедно!
""")